using System;
using System.Collections.Generic;
using System.Text;

namespace Trade
{
   public class Str1 
    {

        List<string> LabelContent = new List<string>();
        public string TextPage { get; set; }
        public string Picture1 { get; set; }
        public string Picture { get; set; }

        public Str1()
        {
            TextPage = "Цель этого упражнения: понять свои особенности мышления, развить навыки обобщения, разобобщения и перехода по аналогиям./n Для начала, расскажу, что же такое это есть – «лингвистические пирамиды». Начнем с того, что оглянемся по сторонам.Первое, на что упал мой взгляд – кружка.Сама по себе кружка является просто кружкой, ничем больше. Однако кружку можно определить в более высокий класс – посуда.Таким образом, мы перешли на 1 класс наверх (обобщили кружку до посуды). С другой стороны, кружка бывает для кофе, чая, полулитровая, алюминиевая, фарфоровая (Разобобщили кружку на различные подвиды кружек)./n Это базовая модель лингвистических пирамид – все есть подвидом чего-то и состоит из чего-то.Кроме этого, в пределах одного класса есть аналогичные предметы.То есть, если мы обобщили кружку до посуды, то аналогиями будут тарелки, миски, стаканы и множество других вещей./n Таким образом, можно тренировать навыки обобщения, разобобщения и перехода по аналогиям.Упражнение делается так.Нужно два человека (ты и твой друг). Один из вас – ведущий, другой – ведомый.Ведомый называет любой предмет, на который падает взгляд.Ведущий начинает показывать, что с этим предметом делать – найти ему аналогию, обобщить до более высокого уровня, разобобщить до более низкого.Чтобы делать это молча, очень хорошо подходит такая система знаков: большой палец вверх – обобщение, вниз – разобобщения, вбок – аналогия.Делать упражнение с 1 предметом около 5 минут, стараясь переходить между классами очень быстро, а не путешествовать только вверх-вниз по посуде.Потом вы меняетесь ролями./nЭто упражнение еще не развивает бредогенератор. Это упражнение учит ваш мозг быстро находить аналогии, что будет дальше развиваться следующими упражнениями.";
        }
    }
}
